#include <iostream> // Подключаю библиотеку iostream

// 15
int main() {
    double temperature {}; // Инициализирую переменную temperature в double

    std::cout << "Пожалуйста, введите любую температуру в C:" << "\n"; // Вывожу приглашение к вводу числа
    std::cin >>  temperature; // Принимаю и сохраняю значение в переменную temperature

    if (temperature < 0) { // Условие: Если температура ниже 0, то:
        std::cout << "Мороз" << "\n"; // Если истина, то вывожу "Мороз"
    } else {
        std::cout << "Тепло" << "\n"; // Если ложь, то вывожу "Тепло"
    }

}