#include <iostream> // Подключаю библиотеку iostream

// 15
int main() {
    int number {}; // Инициализирую int переменную number

    std::cout << "Пожалуйста, введите любое трёхзначное число:" << "\n"; // Приглашаю ввести число
    std::cin >> number; // Принимаю число и сохраняю в переменную number

    if (number < 100 || number > 999) { // Проверяю диапазон ввода - число трёхзначное?
        std::cout << "Ошибка! Число должно быть трёхзначным, данное число не трёхзначное: " << number << std::endl; // Если не трёхзначное, то вывожу на экран сообщение об ошибке
        return 1; // Возвращаю функции main код 1
    }

    int hundreds {number / 100}; // Вычисляю сотни числа
    int units {number % 10}; // Вычисляю единицы числа

    if (hundreds == units) { // Проверяю - сотни равны единицам?
        std::cout << "Это число палиндром: " << number << std::endl; // Если да, то вывожу сообщение на экран, что это число палиндром
    } else {
        std::cout << "Это число НЕ палиндром: " << number << std::endl; // Если нет, то вывожу сообщение на экран, что это число не палиндром
    }
    return 0; // Возвращаю функции main код 0: всё завершилось успешно
}